import { PollMoodDefinition } from './poll-mood';

export const CARING_MOOD: PollMoodDefinition = {
  name: 'милашка',

  questions: [
    (date) =>
      `Polly приготовила для вас немного уюта, хорошую компанию и настолки! 🥹💛 Встречаемся в субботу, ${date}, в 12:00? 🎲`,
    (date) =>
      `Polly соскучилась по нашей компании! 🥰 Давайте увидимся, поболтаем и поиграем в субботу, ${date}, в 12:00? 🫶🎲`,
    (date) =>
      `Обнимашки всем, кто дочитал до сюда! 🤗 Polly приглашает вас на настолки в субботу, ${date}, в 12:00. Будет уютнее, если вы придёте! 🎲💛`,
  ],

  options: {
    YES: ['Тоже скучаю, приду! 🫶', 'Буду рад всех увидеть! 🤗', 'С радостью присоединюсь! 🥰🎲'],

    YES_WITH_FRIEND: [
      'Захвачу с собой друга! 🥰',
      'Приведу друга за порцией уюта! 💛',
      'Прихвачу друга, вместе веселее! 🎲💖',
    ],

    MAYBE: [
      'Если смогу — обязательно! 💛',
      'Пока не знаю, но очень хочу 🫶',
      'Надеюсь, получится присоединиться! 🤞💖',
    ],

    NO: [
      'В другой раз обязательно! 🥹',
      'В этот раз не смогу, но мысленно с вами! 🫶',
      'Не смогу прийти, но буду ждать ваших историй! 🥰',
    ],

    CHAOTIC: [
      'Отправлю вместо себя плюшевого мишку 🧸',
      'А можно я просто посижу рядом и буду мило улыбаться? 🥹',
      'Посылаю вам тысячу виртуальных обнимашек! 🤗💛',
    ],
  },
};
