import { PollMoodDefinition } from './poll-mood';

export const CHAOTIC_MOOD: PollMoodDefinition = {
  name: 'беспредельщица',

  questions: [
    (date) =>
      `ВНИМАНИЕ!!! 🚨 Кубики сбежали, печеньки пропали, Polly не знает, что происходит! 🤯 Настолки в субботу, ${date}, в 12:00! 🎲🍪`,
    (date) =>
      `СРОЧНО!!! 📢 Кто-то сказал «настолки», и Polly уже едет верхом на картошке 🥔💨 Суббота, ${date}, 12:00! Все на борт! 🎲`,
    (date) =>
      `Так, у меня есть план! 😎 План такой: настолки. Когда? В субботу, ${date}, в 12:00. Что дальше? Не знаю, но будет весело! 🌀🎲`,
  ],

  options: {
    YES: [
      'Я уже там, просто ещё не знаю 🤪',
      'Телепортируюсь к началу партии! 🌀🎲',
      'Прибуду верхом на динозавре! 🦖🎲',
    ],

    YES_WITH_FRIEND: [
      'Друг согласился, не зная на что 😈',
      'Захвачу напарника из соседнего измерения 🌌',
      'Позову друга. Если ответит холодильник, придём втроём 🧊',
    ],

    MAYBE: [
      'Может быть, а может быть 🌀',
      'Мой мозг отправил запрос в техподдержку 🧠📞',
      'Я почти решил. Осталось понять, что решал 🤔',
    ],

    NO: [
      'Мой кот против 🐈',
      'Не смогу! Меня держит в заложниках одеяло 🛌',
      'Я бы пришёл, но гравитация сегодня слишком сильная 🌍',
    ],

    CHAOTIC: [
      'Мяу. Больше комментариев не будет 🐈',
      'Мой последний мозговой нейрон ушёл за хлебом 🧠🍞',
      '42. Ответ на всё. Даже на этот опрос 🚀',
    ],
  },
};
