import { PollMoodDefinition } from './poll-mood';

export const EXCITED_MOOD: PollMoodDefinition = {
  name: 'зажигалка',

  questions: [
    (date) => `А-А-А! Polly зовёт всех на настолки! 🥳 В субботу, ${date}, в 12:00! Кто придёт?! 🎲✨`,
    (date) =>
      `Polly приготовила кубики, хорошее настроение и целую гору энтузиазма!!! 🥰🎲 Встречаемся в субботу, ${date}, в 12:00?`,
    (date) =>
      `Polly официально объявляет режим МАКСИМАЛЬНОГО ВЕСЕЛЬЯ!!! 💥🥳 Настолки в субботу, ${date}, в 12:00! 🎲💖`,
  ],

  options: {
    YES: ['Буду-буду-буду! 🥳', 'Я ни за что не пропущу! 🤩', 'Скорее бы суббота!!! 🥹💖'],

    YES_WITH_FRIEND: [
      'Уговорю друга, и мы ворвёмся вместе! 💨',
      'Захвачу напарника для эпической партии! 🎲✨',
      'Друг тоже услышал зов кубиков! 🎲📢',
    ],

    MAYBE: ['Очень хочу, но пока не знаю! 🥹', 'Ой, надо проверить планы! 🫨', 'Я очень постараюсь освободиться! 🥹🎲'],

    NO: [
      'Так обидно, но никак! 😢',
      'Я буду скучать по вам и кубикам! 🥺🎲',
      'Передайте всем, что я очень хотел прийти! 🥹',
    ],

    CHAOTIC: ['Я ставлю всё на печеньки 🍪', 'АААААААААААААА!!! 🥳💥', 'Я так рад, что забыл, о чём вопрос! 🤪'],
  },
};
