import { PollMoodDefinition } from './poll-mood';

export const SERIOUS_MOOD: PollMoodDefinition = {
  name: 'деловая',

  questions: [
    (date) =>
      `Уважаемые игроки! 📋 Приглашаем вас на настольные игры в субботу, ${date}, в 12:00. Просьба подтвердить участие в опросе. 🎲`,
    (date) =>
      `Polly сообщает: встреча любителей настольных игр запланирована на субботу, ${date}, в 12:00. Пожалуйста, укажите, сможете ли вы присутствовать. 📋`,
    (date) =>
      `Polly напоминает: своевременное подтверждение участия поможет подготовить игры и организовать встречу. Суббота, ${date}, 12:00. Жду ваших ответов. 🧐🎲`,
  ],

  options: {
    YES: ['Подтверждаю участие ✅', 'Присутствие гарантирую 🧐', 'Запишите меня в список участников 🎲'],

    YES_WITH_FRIEND: [
      'Подтверждаю: +1 участник ✅',
      'Прошу зарегистрировать двух участников 📑',
      'Прошу подготовить два игровых места 📋',
    ],

    MAYBE: ['Ответ будет позже 🕰️', 'Окончательное решение пока не принято.', 'Прошу оставить вопрос открытым 🧐'],

    NO: [
      'Не смогу присутствовать ❌',
      'В эту субботу присутствовать не получится 📋',
      'Мои планы не позволяют принять участие.',
    ],

    CHAOTIC: [
      'Кто утвердил кубики без моего согласования?! 🎲',
      'Требую внести перерыв на стратегическое обдумывание 🍪',
      'Решение принято единогласно: никто ничего не понял. 📜',
    ],
  },
};
