import { PollMoodDefinition } from './poll-mood';

export const SHY_MOOD: PollMoodDefinition = {
  name: 'скромняшка',

  questions: [
    (date) => `П-простите, что отвлекаю... Но в субботу, ${date}, в 12:00 будут настолки... Вы придёте? 🥺`,
    (date) => `П-полли очень надеется, что вы сможете прийти... Настолки в субботу, ${date}, в 12:00... 🥹🎲`,
    (date) => `П-пожалуйста, не игнорируйте приглашение Polly... 🥹 Настолки в субботу, ${date}, в 12:00! 👉👈`,
  ],

  options: {
    YES: ['Если можно, я тоже... 🙈', 'Д-да... Я приду... 💗', 'М-мне хочется прийти... 🥺🎲'],

    YES_WITH_FRIEND: [
      'Возьму друга... для храбрости 🫣',
      'Можно мы с другом тихонько присоединимся? 🎲',
      'Вдвоём не так страшно... 👉👈',
    ],

    MAYBE: ['Ещё не знаю 🫣', 'М-может быть... 🥹', 'Сердце говорит «да», а стеснение — «ой-ой»... 💓'],

    NO: ['В этот раз никак... 😔', 'Я бы хотел, но не смогу... 🥹', 'В этот раз я останусь дома... 🙈'],

    CHAOTIC: [
      'У меня лапки 🐾',
      'Я хотел ответить, но кнопка на меня посмотрела... 😳',
      'А если я приду и превращусь в стул?.. 🪑🥺',
    ],
  },
};
